Repository: JianLaiTL/JianLai
Catalog: omegat/project_save.tmx
Source language: zh_cn
Languages: en_us

source: 少女在小镇上并不讨喜，受累于少年宋集薪的性情古怪，被取名稚圭的丫鬟不管是去铁锁井打水，还是赶集买东西，或是给自己少年添置文房用品，少女总给人一种不合群的感觉，也没有什么同龄人的玩伴，遇上熟人从来不爱多说话，对于偏好热闹喜庆的小镇百姓而言，这样的少女，实在是很难亲近起来。
en_us: Zhi Gui wasn't a very well-liked figure in the town, and that was partially due to the fact that she was the maidservant to Song Jixin, who was considered to be a little strange and enigmatic by the residents of the town. Regardless of whether she was drawing water from the Iron Lock Well, buying things from the market, or shopping for things on her master's behalf, she never seemed to fit in with those around her, nor did she have any friends of her age. She didn't like to speak much even when running into acquaintances, and for the town's residents, who always festivities and social interaction, it was very difficult for them to warm to her when she had such a unapprochable personality.

source: 少女坐在小板凳上，精疲力竭，挥手道：“知道啦，快点去拿呀。”
en_us: Sitting on a small stool, the exhausted young girl waved her hand and said, "Alright, alright. Now hurry up and get the hatchet for me."

source: 少女大大方方转过身去，面朝小溪上游。
en_us: Ning Yao did as she was told, turning to face the upstream direction of the creek.

source: 少女大手一挥。
en_us: The young girl waved her hand in a sweeping motion.

source: 少女大概不知道，后边这句话更伤人。
en_us: However, the young woman didn't know that this explanation was even more hurtful than her initial words.

source: 少女大步离开宅子。
en_us: Ning Yao strode away from Liu Xianyang's house.

source: 少女大踏步前行，一往无前，沉声道：“我阮秀不是只会吃一件事！也会杀人！”
en_us: The young girl strode forward with an indomitable will, saying in a solemn voice, "Eating isn't the only thing I know how to do! I also know how to kill people!"

source: 少女天人交战许久，深呼吸一口气，才弱弱说了两个字，谢谢。
en_us: After a long mental battle with herself, she took a deep breath and weakly uttered two words — thank you.

source: 少女头顶，凭空出现一只光芒璀璨的金色大手，气势威严，如佛陀一掌降伏天魔，又如道祖一手镇压邪祟，迅猛按在少女脑袋上，迫使她瞬间跪下，额头重重磕在地面。
en_us: An enormous, dazzling golden hand abruptly appeared above Zhi Gui, and it came crashing down with tremendous force like the palm of the Buddha, or the collective hand of Three Pure Ones, instantly forcing Zhi Gui to her knees upon making contact with her head, then slamming her forehead heavily down onto the ground.

source: 少女好似有些不耐烦，讥讽笑道：“偏居隅的井底之蛙，倒是人人都喜欢敝帚自珍。将那方玉玺收回去吧，我直很喜欢句话，叫君子不夺人所好。”
en_us: The young woman seemed to have lost her patience, and she sneered, "What a pair of pitiful fools you are. Just because you see this seal as a priceless treasure doesn't mean it's worth anything in my eyes. You can keep that thing for all I care. A righteous individual does not steal from others."

source: 少女好像也看出少年的不感兴趣，顿时索然无味，挥挥手赶人：“最好把罐子买回来，我等着喝药呢。”
en_us: Ning Yao could tell that he wasn't very interested in this topic, and she immediately lost all interest in showing off as well, waving a dismissive hand as she said, "Hurry up and go buy the clay pot. I'm still waiting on my medicine."

source: 少女宁姚还沉浸在先前那句话的语境里，越陷越深，自言自语道：“一只手打一百个陈平安，嗯，这个说法，适用范围很广啊，见到谁谁谁，切磋之后，如果败于我手，就撂下一句，你才三千个陈平安的实力，也敢与我一战，感觉不错唉，遇见一条洪荒凶兽、大泽恶蛟，就告诉自己这条孽畜相当于三万个陈平安，快跑，哈哈，可以可以”
en_us: However, Ning Yao was still immersed in the comment that she had made just then. She murmured to herself, "Defeating 100 Chen Ping'an's with a single hand... Mhm, this saying has a wide range of applications. When I see someone and spar with them, if I manage to defeat them, I can say, 'You only have the strength of 3000 Chen Ping'an's, yet you still dared to battle with me'. Yeh, that seems fairly impressive. When I come across a ferocious beast or sinister wyrm, I can also tell myself that these evil beasts are equivalent to 30,000 Chen Ping'an's, so I have to flee as quickly as possible. Haha, very nice, very nice..."

source: 少女对刘羡阳说道：“这只柜子不值钱，但是这幅金桂挂月的镶嵌图案，你别轻易贱卖了。”
en_us: The young woman turned to Liu Xianyang and said, "This cabinet isn't worth anything, but the mosaic of the golden cassia embedded into it is a different story altogether. Don't sell it for a cheap price."

source: 少女对此不置可否。
en_us: Ning Yao didn't offer a comment on this.

source: 少女对此无动于衷，抬起双手系紧绷带，对老人说道：“若是在外边，面对位极有可能已经御风远游的武道大宗师，我绝非对手。但是此时此刻，我只要假借飞剑，你必死无疑。”
en_us: The young woman remained unmoved by the boy's offer, and she tightened the bandages around her hands as she said to the old man, "In the face of a master martial artist who's most likely already at the Windsoar Stage like yourself, I definitely wouldn't stand a chance in the outside world, but here in this world, all I have to do is call upon my flying sword, and your demise will be sealed."

source: 少女将那三袋子铜钱推回去，“我不要。”
en_us: The young woman pushed the three bags of copper coins back toward him, saying, "I don't want them."

source: 少女尴尬转头，高高抬起白碗，理直气壮道：“只有yi块呦，我又没有坏规矩！”
en_us: The young girl wore an awkward expression as she lifted her bowl of rice up high and said in a righteous manner, "There's only one piece! I didn't break the rules!"

source: 少女差点气得七窍生烟，大骂道：“小时候被牛尾巴打过脸，了不起啊？！就可以名正言顺地做傻事？气死我了！总之这件事情，陈平安你别管，你以为就你那点三脚猫功夫，能对付一头正阳山的搬山猿？刘羡阳那破宅子，以后你自己管去，你家春联门神，也自己滚去买！我宁姚不伺候！”
en_us: Ning Yao was so furious that steam was almost billowing out of her ears, and she erupted into an incensed tirade. "What the hell's wrong with you? Were you dropped on your head as a baby? Does that give you the justification to constantly do stupid things? I'm about to blow a damn blood vessel! I forbid you from involving yourself in this any further! Do you think a scrawny little kid like you can oppose a Mountain-moving Ape of the Sun Scorch Mountain? Look after Liu Xianyang's shitty house yourself, and if you want door gods and couplets, piss off and buy them yourself! I can't help you!"

source: 少女已经彻底晕死过去。
en_us: Unfortunately for him, the young woman was already completely unconscious, so his panicked ramblings fell upon deaf ears.

source: 少女已经有些神志不清，在敕令仪式即将大功告成之际，突然感觉到整个人腾云驾雾一般，给人扛在肩头就往小镇巷弄里跑去。
en_us: Ning Yao's mind was already fuzzy at this moment, with the Edict Ceremony almost reaching completion. However, she suddenly felt like she was taken on a ride through the clouds and mists as someoned tossed her onto their shoulder and ran toward the alleyway.

source: 少女并非对陈平安没有情感，否则也不会并肩作战到这一步。
en_us: Ning Yao didn't feel no emotion toward Chen Ping'an, or else she wouldn't have accompanied him all this time.

source: 少女当时只觉得自己做了一件极其潇洒的事情，仅此而已。
en_us: She felt like she had just done something extremely natural and dashing. This was all there was to it.

source: 少女很快用手指了指那袋子迎春钱，“比如这袋，我就很喜欢，其它两袋子供养钱、压胜钱的铜钱样式，不好看，铸也不讨喜。”
en_us: The young woman quickly pointed at the bag of Greeting Spring Coins and said, "For example, this pouch is quite to my liking. The patterns of the Offering Coins and Good Fortune Coins don't look very good, and their makes don't suit my taste either."

source: 少女很是哀其不幸，怒其不争。
en_us: The young woman was expressing great pity for his misfortune, yet she was also expressing deep annoyance at his lack of fight.

source: 少女很是灰心丧气，本来意气风发的神采，锋芒锐减，没好气道：“比如你救了我一命，我事后自会帮你杀掉老龙城的苻南华，或是书简湖的刘志茂，但是你想要两个都杀的话，永绝后患，就得破财消灾，因为咱俩一场萍水相逢，可没那么深厚的情分，所以你需要用一袋子金精铜钱，作为报酬。”
en_us: The young woman was extremely disheartened. Her high spirits and vigor receded like a tide, and she huffed, "What I'm trying to say is, since you saved my life, I'll naturally help you kill the Old Dragon City's Fu Nanhua in the future. Or Lake Shujian's Liu Zhimao. If you want to kill both of them to completely eliminate all future threats, however, you'll have to offer some money to do away with the misfortune. After all, the two of us are nothing more than strangers who came together by chance. In other words, you need to pay me with a pouch of copper coins."

source: 少女微微张大嘴巴，整个人跟被雷劈了似的，心如死灰。
en_us: The young girl opened her mouth, yet she didn't know what to say. Her expression was ashen, and it was as if she had been struck by lightning.

source: 少女心情复杂，愤愤道：“敢这么玩，老猿没打死你，算你狗屎运！”
en_us: A series of mixed emotions welled up in Ning Yao's heart, and she grumbled, "Do you have a death wish? You're extremely lucky that old ape didn't kill you!"

source: 少女心知肚明，在这座小镇上，身躯体魄仍属普通的少年，被仙家人物一拳打烂胸膛，谁都救不了。再者，如果刘羡阳有救，哪怕只有一线生机，以陈平安的烂好人性格，恐怕就是待在铁匠铺那边会被人砍头，也绝对不会擅自离开半步。
en_us: Ning Yao knew that in this town, where all mystical abilities were strictly prohibited, there was no way that anyone would be able to save him from the grievous injuries that he had sustained. Additionally, given Chen Ping'an's personality, even if there were still the slightest of chances that Liu Xianyang could be saved, he would've never left Liu Xianyang's side.

source: 少女怅然若失，晃了晃脑袋，不再深思，回头继续骂槐。
en_us: The young girl felt a sense of despondance. However, she quickly shook her head and pushed these thoughts out of her mind. She then turned back around and continued to viciously scold the old locust tree.

source: 少女怒目相向，“对你个大头鬼”
en_us: Ning Yao glared back at him. "Right in your dreams!"

source: 少女怒道：“用双手！懂点礼数好不好？！”
en_us: "Use both hands! Have some manners, will you?!" Ning Yao snapped.

source: 少女恶狠狠道：“他自己记不牢签，我怎么给他解签？真当我是神仙啊！”
en_us: "If he doesn't remember properly, how in the world can I explain it for him? Am I a god or something?!" Ning Yao said ferociously.

source: 少女惋惜道：“果然如此。”
en_us: "As expected," Ning Yao said in pity.

source: 少女愣了愣，然后开怀道：“还真成了？可以啊，陈平安！”
en_us: Ning Yao faltered slightly upon hearing this, then suddenly burst into laughter. "You actually managed to do it? That's incredible!"

source: 少女懵懵懂懂，但仍是没有开口说话，两眼有些放空，扭头怔怔望着波光粼粼的溪水。
en_us: The young girl was still a bit befuddled, but she still refused to open her mouth to speak. Her eyes appeared slightly vacant as she turned around to stare at the glistening creek in a daze.

source: 少女手上的力道立即弱了一大截，感觉全身力气都随着小镇上的吃食点心溜走了。
en_us: The young girl's movements instantly became much weaker, and it was as if all of her strength was flowing away with the snacks from the small town.

source: 少女手托着腮帮，手伸出手指，拨弄着三枚铜钱，随口问道：“你的事情如何了能不能跟我说说”
en_us: The young woman rested her chin in one hand as she reached over to play around with three coins with her other. "How did everything go? Are you able to tell me?" she casually asked.

source: 少女手指微动，长剑随之轻灵旋转，笑了笑，“难怪我爹说你们东宝瓶洲的正阳山，不值一提，素来口气大剑道低，人傻胆大剑气浅。”
en_us: Ning Yao moved her fingers slightly, causing her sword to spin in an agile manner. She smiled and said, "No wonder my father said that the Eastern Treasured Vial Continent's Sun Scorch Mountain isn't worth a mention. The cultivators there talk big but have little skills to back up their boasts. You people have blind courage, but you're unfortunately stupid and have extremely shallow Sword Qi."

source: 少女打了个哈欠，趴在桌子上，懒洋洋道：“说到这里就差不多了，炼体三境界，已经将八成入品武人挡下来，再难更进一步，要知道穷学文富学武这个道理，除了我家乡，其余天下皆然，按照你的家底，以及你的悟性，我估摸着这辈子能够到达第二层境界，就该烧高香了。”
en_us: The young girl yawned before resting her arms and head on the table and saying in a lazy voice, "And that's about all. The three tiers of the Physique Refining Tier is already able to stop the footsteps of 80% of martial artists, preventing them from advancing any further. You have to understand that those who are poor study books, while those who are rich study martial arts. Apart from my hometown, this principle hold true everywhere else. Judging by your wealth and your comprehension ability, I'd say that you can burn incense and thank the heavens if you ever manage to reach the second tier."

source: 少女抬起头，死死盯住中年儒士。
en_us: Zhi Gui raised her head to glower intently at Qi Jingchun, who took a step toward her.

source: 少女指了指不远处那只打开的包裹，示意可以用那些糕点来换鱼，陈平安摇头笑道：“不行，糕点好吃，也能填饱肚子，但是不如鱼汤养人。”
en_us: The young girl pointed at the bag of food nearby, signifying that she could use some of her snacks as payment. However, Chen Ping'an shook his head with a smile, saying, "Sorry, even though the snacks are tasty, and even though they're filling, they're still not as nutrituous and nourishing as fish soup."

source: 少女指了指其中一只金黄绣袋。
en_us: Ning Yao pointed at the pouch that was decorated with gold patterns.

source: 少女指了指自己鼻子，问道：“你是问我家公子宋集薪有没有槐叶，还是我，一个无父无母的小婢女？”
en_us: Zhi Gui pointed at herself as she asked, "Are you asking if my young master has any locust leaves, or me, a little maidservant with no parents?"

source: 少女挑了一下眉头，“明天再说，我有些困。”
en_us: Ning Yao raised an eyebrow and replied, "We'll talk about it tomorrow. I'm getting a bit tired now."

source: 少女挑了一下眉头，年轻道人的笑容便随之刻板僵硬起来。
en_us: All of a sudden, the young woman raised an eyebrow, and the Daoist priest's smile instantly stiffened upon seeing this.

source: 少女接过钱袋子后，捧在胸口，她笑得眯起双眼，很开心，稍稍侧身施了一个万福，“谢过赵公子，我家少爷说过，积善之家有余庆，行善之人有福田，奴婢在这里预祝赵公子青云直上，鹏程万里。”
en_us: Zhi Gui accepted the bag of coins and held it before her chest, with her eyes twinkling in happiness. She curtseyed and said, "Thank you, Young Master Zhao Yao. Young Master has said before that those who do good will be rewarded with fortune. Let this servant offer her best wishes to Young Master Zhao who will surely ascend to the skies and soar boundless distances in the future."

source: 少女摇头道：“不用。”
en_us: The young girl shook her head and replied, "No."

source: 少女摇头道：“对我来说，没有意义。”
en_us: The young woman shook her head. "It won't make much difference for me."

source: 少女摇摇晃晃站起身，笑容惨白，微微露出森严的牙齿，“先生今日教诲，奴婢记下了。”
en_us: Zhi Gui rose unsteadily to her feet as a wry smile appeared on her face. "I will be sure to remember your teachings, Sir."

source: 少女摇摇晃晃落地后，双指并拢作剑，抵住额头眉心处，咬牙切齿道：“出来！给我斩开这方天地！”
en_us: After shakily landing on the ground, she put her index finger and middle finger together to form a sword. She then placed her fingers on her glabella and said through gritted teeth, "Come out! Shatter this heaven and earth!"

source: 少女撂下一句，“走了。”
en_us: "I'm leaving now," Ning Yao said.

source: 少女撇撇嘴，这逞什么强啊。
en_us: Ning Yao rolled her eyes in response, seemingly dismayed by Chen Ping'an's effort to put on a strong front.

source: 少女收回手，重重叹了口气，怜悯道：“陈平安啊，你以后就算侥幸娶了媳妇，多半也是个缺心眼的。”
en_us: Ning Yao heaved a heavy sigh as she retracted her hand, saying in a sympathetic voice, "Chen Ping'an, even if you're fortunate enough to find yourself a wife in the future, she'll most likely be a scatter-brained person."

source: 少女放下那根老剑条，拨开身前两侧火星，火星被她随手挥退，牵一发而动全身，本该静止在光阴长河里的星火，不断撞击着火星，一次次相互撞击，使得屋内的光线，显得絮乱无比。
en_us: The young girl placed down the old sword billet before sweeping away the sparks before her. The sparks were easily swept aside, and the movement of a few instantly triggered the movement of them all. The sparks that should have been frozen in time started to chaotically clash and glow, with their innumerable collisions causing the brightness in the room to fluctuate without pattern.

source: 少女故意将嗓音弄得成熟沉闷，将剑缓缓放入鞘内，变成单手握刀的姿态，以刀尖直指儒士，“你怎么‘觉得’，那是你的事情，我不管。”
en_us: The young woman feigned a deep and mature voice as she slowly sheathed her sword, holding her saber in one hand with the tip pointed directly at Qi Jingchun as she said, "What you think doesn't matter to me. What matters to me is what I think! I'll do whatever I want, and if you want to stop me, you're free to try!"

source: 少女无言以对。
en_us: Ning Yao didn't know what to say to this.

source: 少女有气无力道：“没辙。”
en_us: "I genuinely don't know how to respond," the young woman said without strength.

source: 少女本就不是拖泥带水的性子，没有拒绝，收起两袋子铜钱后，皮笑肉不笑道：“天底下多得是往自己兜里搂钱的人，还有你这种喜欢当散财童子的？”
en_us: Ning Yao wasn't a hesitant person, so she didn't refuse Chen Ping'an's offer this time, accepting two bags of copper coins. She wore a fake smile as she said, "Many people in the world try to stuff as much money as they can into their pockets. Yet, there are also people like you who enjoy tossing money at others?"

source: 少女本来就不是擅长言辞的人，干脆就想到什么就说什么了：“你别这么鲁莽，正阳山本就是我们东宝瓶洲的名门大派，那头老猿的身份，其实与正阳山老祖无异了，哪怕老猿在此地无法使用术法神通，可要是对付你，很简单！再就是他重伤刘羡阳后，齐先生一定会惩罚他的，所以你最少不用担心这件事情，会被当做什么都没发生”
en_us: Ruan Xiu wasn't that good with words in her first place, and she took the simple route this time, simply speaking her mind as she urged, "Don't be so reckless! The Sun Scorch Mountain is an extremely renowned sect of our Eastern Treasured Vial Continent, and that old ape is no different in status from the patriarchs of the Sun Scorch Mountain! Even if he can't use any of his mystical abilities in this place, he'll still be able to snap you like a twig! On top of that, Mr. Qi will definitely punish him for what he did to Liu Xianyang, so there's no need for you to get involved. Rest assured, something will definitely be done about this..."

source: 少女松开手，立即抓起糕点，狼吞虎咽。
en_us: The young girl let go and immediately turned her attention back to the snacks, starting to scoff them down again.

source: 少女欲言又止，最后望向那个瘦弱背影，感慨道：“那你知不知道，你的拳头不硬的话，就没有人会在乎你的对错。”
en_us: Ning Yao wanted to say something, but she hesitated for a moment before eventually looking at the back of the skinny young boy. She sighed with emotion and said, "Then do you know? If your fists aren't strong enough, no one will care whether you're right or wrong."

source: 少女此时就站在院墙那边，她有一双杏眼，怯怯弱弱。
en_us: At this moment, Zhi Gui was standing on the other side of the wall with a timid look in her large, round eyes.

source: 少女死死盯住那道大门。
en_us: Zhi Gui stared intently at the gate.

source: 少女死死盯着陈平安，试图从少年脸上寻找出震惊、仰慕和疑惑，可陈平安偏偏是一脸“我听明白了，姑娘你接着说”的欠揍表情。
en_us: Ning Yao stared intently at Chen Ping'an, hoping to find a hint of astonishment, admiration, or confusion on his face. To her dismay, however, Chen Ping'an's expression was a punchable one that seemingly said, "I understand, please continue."

source: 少女气不打一处来，“滚！”
en_us: The young girl was extremely ticked off, and she replied, "Bug off!"

source: 少女气势再降，怯生生道：“中午吃得少了，肚子饿，捶不动了。”
en_us: The young girl's intensity fell even further as she said timidly, "I ate too little for lunch... I'm a bit hungry now, so I don't have the energy to swing the hammer anymore."

source: 少女气势骤然下降，低声道：“爹？”
en_us: The young girl's intensity suddenly dropped by a drastic amount, and she silently called, "Dad?"

source: 少女气呼呼道：“你知道个屁”
en_us: "You don't know squat!" Ning Yao huffed angrily.

source: 少女沉默片刻，嗓音低沉道：“受教！”
en_us: The woman was silent for a moment before replying in a deep voice, "I humbly accept your teachings!"

source: 少女没有任何藏藏掖掖，回答道：“我耗尽所有奇遇积攒下来的家底，加上一个人情，才换来进入小镇的这个名额，不过我跟那些人不一样，我不求什么机缘气数，只是想着让人帮我铸一把剑，最好能够合我的心意，至于锋利不锋利，能否承载海量剑气，是很其次的事情。”
en_us: The young woman didn't try to conceal anything, replying, "I was only able to obtain a position to enter this small town after exhausting all of my savings and using up a favor. However, I'm not like the others. I'm not looking for a fated opportunity or whatever, and I simply want to ask someone to forge a sword for me. It'll be best if it's a sword that resonates with my ideals. As for whether its sharp or not, and as for whether it can carry a boundless Sword Qi or not, all of these are secondary."

source: 少女没有善罢甘休，继续说道：“不愿意给是吧，那我宁姚跟你借总行了吧？有借有还的那种。”
en_us: However, Ning Yao didn't give up, and she continued, "So you're not willing to give it to me? Then what about lending it to me? That should be fine, right? I'll make sure to return it to you."

source: 少女没有接过钱袋，气极反笑，“那要不要帮你每年春节贴春联和门神啊？”
en_us: Ning Yao didn't accept the pouches from him, and she scoffed, "Do you want me to put up couplets and door gods on your door every Spring Festival as well?"

source: 少女没有睁眼，左手握住刚刚归鞘的剑柄，一道寒光横扫儒士腰间，试图将其拦腰斩断。
en_us: The young woman didn't even flinch as she grabbed onto the hilt of her sword with her left hand, then drew it from its scabbard once again before slashing it at Qi Jingchun's waist, all in one smooth motion.

source: 少女没说话。
en_us: The young girl didn't reply.

source: 少女深呼吸一口气，一拍桌子瞪眼道：“看什么看，自己看去，我不稀罕！”
en_us: The young woman took a deep breath. She then slammed the table before glaring at Chen Ping'an and saying, "Read through what? You can read it yourself! I'm not interested!"

source: 少女满是失落，“这样啊。”
en_us: "Oh, is that right," the young girl replied in disappointment.

source: 少女点了点头，没有恼羞成怒，只是大大方方诚心诚意说了句：“感谢道长救命之恩。”
en_us: The young woman nodded in response, and instead of displaying any anger or indignation, she said in a genuine voice, "Thank you for saving me."

source: 少女点头。
en_us: Ning Yao nodded in agreement, indicating that she was up to the task.

source: 少女点头沉声道：“我们跟杨老头熟悉，要跟他求一副药。”
en_us: "We're acquainted with Old Man Yang, and we want to obtain some medicine from him," Ning Yao replied solemnly.

source: 少女点点头，又摇摇头，“我听说这里每隔甲子时光，就会换上一位三教中的圣人，来此主持一座大阵的运转，已经好几千年了，时不时有人从这里出去后，要么身怀异宝，要么修为突飞猛进，所以我就想来看看。看到你的时候，我就确定你的身份了，不然当时我出手，就不会那么直截了当。”
en_us: The young woman nodded, then shook her head. "I heard that once every 60 years, a different sage of the three teachings would be sent here to overse the operation of the array, and that this has been going on for thousands of years. I've also heard that the people who've occasionaly emerged from this place have all either been in possession of powerful treasures or have made rapid progress in their cultivation base. Hence, I wanted to come here and take a look. As soon as I saw you, I immediately realized who you were. Otherwise, I wouldn't have lashed out so decisively."

source: 少女点点头，没有强人所难，默默坐回原位，小心翼翼将鱼放在脚边，然后继续她“坐吃山空”的大业。
en_us: The young girl nodded in understanding, not forcing Chen Ping'an to cater to her whims. She quietly returned to her spot before carefully putting down then fish. She then continued to tackle her small mountain of food.

source: 少女猛然抬起头，抓住男人手臂，她手腕上一只赤红手镯，熠熠生辉，呈现出头尾衔接的蛟龙之姿。
en_us: The young girl suddenly looked up and grabbed onto the man's arm, with the crimson bracelet on her hand shining brightly and appearing much like a curled up flood dragon.

source: 少女猛然绷紧身体，爹下过“旨意”，她每天只能吃yi份荤菜，所以她假装像是只盛了yi碗白米饭，将红烧肉藏在其中。为的就是晚上能够光明正大吃上yi份荤菜。
en_us: However, she immediately froze in the next moment. Her father had issued a "decree" before, saying that she could only eat one meat dish a day. Thus, she had pretended to get a full bowl of rice, but she had actually hidden a piece of braised pork belly inside. This was so that she could rightfully eat another meat dish at night.

source: 少女猛然起身，“你不管，我来管！”
en_us: The young girl suddenly stood up, and she shouted, "If you're not going to deal with them, then I'll go and deal with them myself!"

source: 少女猛然转身，率先行走于廊桥中。
en_us: Ning Yao turned around and departed first, making her way down the covered bridge.

source: 少女用三根手指按住三枚铜钱，在桌面上抹来抹去，“爱说不说。”
en_us: Ning Yao placed three slender fingers on three separate copper coins, dragging them around the table. "Do whatever you want."

source: 少女疑惑道：“爹，不会感到可惜啊？”
en_us: "Father, won't you feel like that's a great pity?" the girl asked with a puzzled expression.

source: 少女皱了皱眉头，“不一定，有些人运气好，可能当天来回，有些人运气差，一辈子就交待在这里了。如果一定要我给出一个推断的话，也行，但是未必准，你自己看着办，比如我们这拨人，一行八人，两拨属于狗大户，人傻钱多，他们一看就不像是能来去匆匆的，怎么都该在小镇上待个几天，那个戴高冠挂玉佩的公子哥，估摸着会相对顺利一些，有个傻大个，一门心思对付那口水井了，能不能得逞，看老天爷赏不赏这碗饭给他吃。”
en_us: Ning Yao's brows furrowed slightly as she replied, "That's hard to say. Some people are extremely fortunate and can leave the very same day they came. Others are not so fortunate, and this could be their final resting place. If you insist on getting my opinion on the matter, then I can tell you, but my estimates may not be accurate, so make of that what you will. If we take a look at the eight people that I came into the town with as an example, there are two groups of people from powerful families. They're not going to be very smart, but they'll have a lot of money on their hands, and I'm sure they won't be leaving the town anytime soon. At the very least, they'll be staying in the town for a few days. The guy with the tall hat and the jade pendant will probably have a relative easier time getting what he wants. In contrast, there's an idiot who's focused all of his efforts on that well. As for whether he'll succeed or not, that'll depend on his luck."
